#!/usr/bin/env python3
# -*- coding: utf-8 -*-

#Даны два числа.
#Найти их сумму, разность, произведение, а также частное от деления первого числа на второе.

num_1 = int(input("Введите число 1: "))
num_2 = int(input("Введите число 2: "))
 a = num_1
 b = num_2
 c = a + b
 d = a - b
 e = a * b
 f = a / b
 print("Сумма чисел: ", c)
 print("Разность чисел: ", d)
print("Произведение чисел: ", e)
print("Деление чисел: ", f)
